pyhton :
1 b
2 a
3 d
4 a
5 c
6 d
7 a
8 a
9 c d
10 a b c



ML:
1 a
2 a
3 c
4 d
5 b
6 c a
7 d 
8 a c
9 c
10 d

In [2]:
import pandas as pd
import numpy as np

In [3]:
data =  {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin',
'Jonas'],
 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [7]:
df = pd.DataFrame(data,index= ['I', 'II', 'III', 'IV', 'V', 'VI', 'VII', 'VIII', 'IX', 'X'])

In [8]:
df.head()

          name  score  attempts qualify
I    Anastasia   12.5         1     yes
II        Dima    9.0         3      no
III  Katherine   16.5         2     yes
IV       James    NaN         3      no
V        Emily    9.0         2      no

In [10]:
data = df[['name','score']]

In [11]:
data

           name  score
I     Anastasia   12.5
II         Dima    9.0
III   Katherine   16.5
IV        James    NaN
V         Emily    9.0
VI      Michael   20.0
VII     Matthew   14.5
VIII      Laura    NaN
IX        Kevin    8.0
X         Jonas   19.0

In [12]:
subset = df.loc[ ['III' , 'V','VI','VIII'] ,['name', 'score'] ]

In [13]:
subset

           name  score
III   Katherine   16.5
V         Emily    9.0
VI      Michael   20.0
VIII      Laura    NaN

In [29]:

less = df['score'] >= 15


grt = df['score'] <= 20


df[less & grt]

          name  score  attempts qualify
III  Katherine   16.5         2     yes
VI     Michael   20.0         3     yes
X        Jonas   19.0         1     yes